; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image6 - mode
	thermograph8 - mode
	thermograph4 - mode
	thermograph5 - mode
	infrared7 - mode
	infrared1 - mode
	infrared0 - mode
	image3 - mode
	spectrograph2 - mode
	GroundStation2 - direction
	Star6 - direction
	Star7 - direction
	GroundStation8 - direction
	Star3 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Star1 - direction
	Star5 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 thermograph8)
	(supports instrument0 infrared0)
	(supports instrument0 image3)
	(supports instrument0 infrared7)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph5)
	(supports instrument1 thermograph4)
	(supports instrument1 image6)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
)
(:goal (and
	(have_image Phenomenon9 thermograph8)
	(have_image Phenomenon9 spectrograph2)
	(have_image Phenomenon10 thermograph4)
	(have_image Phenomenon10 spectrograph2)
	(have_image Phenomenon10 infrared7)
	(have_image Phenomenon11 thermograph4)
	(have_image Phenomenon11 thermograph8)
	(have_image Star12 image6)
	(have_image Star12 image3)
	(have_image Star12 infrared1)
	(have_image Planet13 infrared1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 11
2. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 11
3. (turn_to satellite0 planet13 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet13)
   goals met: 0 of 11
4. (take_image satellite0 planet13 instrument1 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 1 of 11
5. (turn_to satellite0 phenomenon9 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 11
6. (take_image satellite0 phenomenon9 instrument1 spectrograph2)
   added: (have_image phenomenon9 spectrograph2)
   goals met: 2 of 11
7. (turn_to satellite0 phenomenon11 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 11
8. (take_image satellite0 phenomenon11 instrument1 thermograph4)
   added: (have_image phenomenon11 thermograph4)
   goals met: 3 of 11
9. (turn_to satellite0 phenomenon10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 11
10. (take_image satellite0 phenomenon10 instrument1 thermograph4)
   added: (have_image phenomenon10 thermograph4)
   goals met: 4 of 11
11. (take_image satellite0 phenomenon10 instrument1 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 5 of 11
12. (turn_to satellite0 star12 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star12)
   goals met: 5 of 11
13. (take_image satellite0 star12 instrument1 image6)
   added: (have_image star12 image6)
   goals met: 6 of 11
14. (take_image satellite0 star12 instrument1 infrared1)
   added: (have_image star12 infrared1)
   goals met: 7 of 11
15. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 7 of 11
16. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 7 of 11
17. (turn_to satellite0 groundstation0 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 groundstation0)
   goals met: 7 of 11
18. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 7 of 11
19. (turn_to satellite0 phenomenon10 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon10)
   goals met: 7 of 11
20. (take_image satellite0 phenomenon10 instrument0 infrared7)
   added: (have_image phenomenon10 infrared7)
   goals met: 8 of 11
21. (turn_to satellite0 phenomenon11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon11)
   goals met: 8 of 11
22. (take_image satellite0 phenomenon11 instrument0 thermograph8)
   added: (have_image phenomenon11 thermograph8)
   goals met: 9 of 11
23. (turn_to satellite0 phenomenon9 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon9)
   goals met: 9 of 11
24. (take_image satellite0 phenomenon9 instrument0 thermograph8)
   added: (have_image phenomenon9 thermograph8)
   goals met: 10 of 11
25. (turn_to satellite0 star12 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star12)
   goals met: 10 of 11
26. (take_image satellite0 star12 instrument0 image3)
   added: (have_image star12 image3)
   goals met: 11 of 11
